InformationRegisters/СведенияОФайлах1САрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФайлах1САрхив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокументаБИА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовБИА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовБИА</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормыПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияС1САрхивомВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ИнтеграцияС1САрхивомИспользуется() Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1САрхивом") Тогда
		Возврат ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом");
	КонецЕсли;
	Возврат Ложь;
КонецФункции

#Область СохранениеВариантовОтчетов

Функция ПоместитьТабличныйДокументВоВременноеХранилище(ПечатнаяФорма, ПараметрыЗаписи, ПереданныеНастройки) Экспорт
	
	ИнтеграцияС1САрхивом.ЗаполнитьПараметрыИзКомпоновщикаНастроек(ПараметрыЗаписи);
	
	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	ЗаполнитьЗначенияСвойств(НастройкиСохранения, ПереданныеНастройки);
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;

	ПереводитьИменаФайловВТранслит = НастройкиСохранения.ПереводитьИменаФайловВТранслит;

	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();

	ОбъектыДляПрикрепления = Неопределено;
	Если ПереданныеНастройки.Свойство("ОбъектыДляПрикрепления") Тогда
		ОбъектыДляПрикрепления = ОбщегоНазначения.СкопироватьРекурсивно(ПереданныеНастройки.ОбъектыДляПрикрепления);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	ИмяВременногоКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(ИмяВременногоКаталога);
	
	Если ИнтеграцияС1САрхивом.ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПечатнаяФорма.Защита Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ПечатнаяФорма.ВысотаТаблицы = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
		ТипФайла = ТипФайлаТабличногоДокумента[ВыбранныйФормат];
		НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
		
		ИмяФайла = ИнтеграцияС1САрхивом.ИмяФайлаСохраненияОтчета(ПараметрыЗаписи.Заголовок, ПараметрыЗаписи.Организация, ПараметрыЗаписи.Период);
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
		
		Если ПереводитьИменаФайловВТранслит Тогда
			ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла);
		КонецЕсли;
		
		РасширениеФайла = НастройкиФормата.Расширение;
		ИмяФайлаСРасширением = ИмяФайла + "." + РасширениеФайла;
		ПолноеИмяФайла = ИмяВременногоКаталога + ИмяФайлаСРасширением;
		
		МаксимальнаяДлина = 218; // https://docs.microsoft.com/en-us/office/troubleshoot/office-suite-issues/error-open-document
		Если ТипФайла = ТипФайлаТабличногоДокумента.XLS И СтрДлина(ПолноеИмяФайла) > МаксимальнаяДлина Тогда
			МаксимальнаяДлина = МаксимальнаяДлина - 5; // Резерв для формирования уникального имени.
			Если СтрДлина(ИмяВременногоКаталога) < МаксимальнаяДлина Тогда
				ИмяФайла = Лев(ИмяФайла, МаксимальнаяДлина - СтрДлина(ИмяВременногоКаталога) - СтрДлина(РасширениеФайла) - 1);
				ИмяФайлаСРасширением = ИмяФайла + "." + РасширениеФайла;
				ПолноеИмяФайла = ИмяВременногоКаталога + ИмяФайлаСРасширением;
			КонецЕсли;
		КонецЕсли;
		
		ПолноеИмяФайла = ФайловаяСистема.УникальноеИмяФайла(ПолноеИмяФайла);
		ПечатнаяФорма.Записать(ПолноеИмяФайла, ТипФайла);
		
		Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
			УправлениеПечатью.ВставитьКартинкиВHTML(ПолноеИмяФайла);
		КонецЕсли;
		
		Для Каждого ОбъектДляПрикрепления Из ОбъектыДляПрикрепления Цикл
			ОбъектПечати = ОбъектДляПрикрепления.Ключ;
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
			ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ПараметрыЗаписи.УникальныйИдентификаторХранилища);
			ОписаниеФайла = Новый Структура;
			ОписаниеФайла.Вставить("Представление", ИмяФайлаСРасширением);
			ОписаниеФайла.Вставить("ИмяФайла", ИмяФайла);
			ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
			ОписаниеФайла.Вставить("ОбъектПечати", ОбъектПечати);
			
			Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
				ОписаниеФайла.Вставить("Кодировка", "windows-1251");
			КонецЕсли;
			Результат.Добавить(ОписаниеФайла);
		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременногоКаталога);

	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	ЗаполнитьЗначенияСвойств(НастройкиСохранения, ПереданныеНастройки);
	
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		Результат = ИнтеграцияС1САрхивом.ПоместитьФайлыВАрхив(Результат, ПараметрыЗаписи, ПереданныеНастройки, НастройкиСохранения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрисоединитьПечатныеФормыКОбъекту(ФайлыВоВременномХранилище) Экспорт
	Результат = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		Для Каждого Файл Из ФайлыВоВременномХранилище Цикл
			Если МодульРаботаСФайлами.КОбъектуМожноПрисоединятьФайлы(Файл["ОбъектПечати"]) Тогда
				ПараметрыФайла = МодульРаботаСФайлами.ПараметрыДобавленияФайла();
				ПараметрыФайла.ВладелецФайлов = Файл["ОбъектПечати"];
				ПараметрыФайла.ИмяБезРасширения = Файл.Представление;
				Результат.Добавить(МодульРаботаСФайлами.ДобавитьФайл(
					ПараметрыФайла, Файл.АдресВоВременномХранилище, , НСтр("ru = 'Отчет'")));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ЗаписатьСведенияОтчетов1САрхив(Файлы, ПараметрыЗаписи) Экспорт
	Перем РегламентированныйОтчет, ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных, ПолноеИмяОбъектаМетаданных, Период, Организация;
	
	Для Каждого Файл Из Файлы Цикл

		Если Файл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(ТипЗнч(Файл)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыЗаписи.Свойство("РегламентированныйОтчет", РегламентированныйОтчет) Тогда
			Если ТипЗнч(РегламентированныйОтчет) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
				ПараметрыЗаписи.Вставить("Организация", РегламентированныйОтчет.Организация);
				ПараметрыЗаписи.Вставить("Период", РегламентированныйОтчет.ДатаПодписи);
				ПараметрыЗаписи.Вставить("ИдентификаторПечатнойФормы", РегламентированныйОтчет.ИсточникОтчета);
				ПараметрыЗаписи.Вставить("ИдентификаторОбъектаМетаданных", ИдентификаторРегламентированногоОтчета(РегламентированныйОтчет.ИсточникОтчета));
			КонецЕсли;
		ИначеЕсли ПараметрыЗаписи.Свойство("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных) Тогда
			ПараметрыЗаписи.Вставить("ИдентификаторОбъектаМетаданных",ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъектаМетаданных));
		КонецЕсли;
		
		ПараметрыЗаписи.Свойство("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы);
		ПараметрыЗаписи.Свойство("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
		ПараметрыЗаписи.Свойство("Организация", Организация);
		ПараметрыЗаписи.Свойство("Период", Период);
		
		ВидДокументаБИА = Справочники.ВидыДокументовБИА.НайтиВидДокумента(ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных);
		Сведения1САрхив = Новый Структура("Файл, ВидДокументаБИА, ИдентификаторПечатнойФормы", Файл, ВидДокументаБИА, ИдентификаторПечатнойФормы);
		Если ЗначениеЗаполнено(ВидДокументаБИА) Тогда
			Сведения1САрхив.Вставить("НеВыгружать", ВидДокументаБИА.НеВыгружать);
		Иначе
			Сведения1САрхив.Вставить("НеВыгружать", Истина);
		КонецЕсли;

		Если ТипЗнч(Период) = Тип("Дата") Тогда
			Сведения1САрхив.Вставить("Дата",Период);
		ИначеЕсли ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда
			Сведения1САрхив.Вставить("Дата",Период.ДатаОкончания);
		КонецЕсли;
		Сведения1САрхив.Вставить("Организация", Организация);
		Сведения1САрхив.Вставить("Номер", НСтр("ru = 'Без номера'"));
		
		ИнтеграцияС1САрхивом.ЗаписатьСведения1САрхив(Сведения1САрхив);

	КонецЦикла;
	
КонецПроцедуры

Функция ОбъектыПечати() Экспорт
	ОбъектыПечати = Новый СписокЗначений;
	ПапкаФайлов1САрхив = ИнтеграцияС1САрхивом.ПапкаФайлов1САрхив();
	Если ЗначениеЗаполнено(ПапкаФайлов1САрхив) Тогда
		ОбъектыПечати.Добавить(ПапкаФайлов1САрхив);
	КонецЕсли;
	Возврат ОбъектыПечати;
КонецФункции

Процедура ЗаписатьСведенияПечатнойФормы1САрхив(Файл, Знач НастройкиПечатныхФорм, Знач ОбъектыПечати, Знач ПараметрыФормы, Знач ПараметрОповещения) Экспорт
	
	Перем РезультатПодписанияФайлов, НомерДокумента, ДатаДокумента, СотрудникТрудовогоДоговора, ИдентификаторПечатнойФормы;
	
	Если Файл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(ТипЗнч(Файл)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбъектыПечати.НайтиПоЗначению(Файл.ВладелецФайла) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрОповещения) = Тип("Структура") Тогда
		ПараметрОповещения.Свойство("РезультатПодписанияФайлов", РезультатПодписанияФайлов);
	КонецЕсли;
	
	Если ПараметрыФормы.ИмяМенеджераПечати = "Справочник.Сотрудники" Тогда
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.Сотрудники);
	Иначе
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Файл.ВладелецФайла.Метаданные());
	КонецЕсли;
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если НастройкаПечатнойФормы.Печатать И ЗначениеЗаполнено(ИдентификаторПечатнойФормы) Тогда
			Возврат;
		ИначеЕсли НастройкаПечатнойФормы.Печатать Тогда
			ИдентификаторПечатнойФормы = НастройкаПечатнойФормы.ИмяМакета;
		КонецЕсли;
	КонецЦикла;
	
	Сотрудник = Неопределено;
	Если ТипЗнч(Файл.ВладелецФайла) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Если ТипЗнч(ПараметрыФормы.ПараметрКоманды) = Тип("Массив") Тогда
			Для Каждого ПараметрКоманды Из ПараметрыФормы.ПараметрКоманды Цикл
				Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Сотрудники") Тогда
					Если ПараметрКоманды.ФизическоеЛицо = Файл.ВладелецФайла Тогда
						Если Сотрудник = Неопределено Тогда
							Сотрудник = ПараметрКоманды;
						Иначе
							Сотрудник = Неопределено;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(РезультатПодписанияФайлов) = Тип("Массив") Тогда
		Для Каждого РезультатПодписания Из РезультатПодписанияФайлов Цикл
			Если РезультатПодписания.ФайлОбъекта = Файл Тогда
				Сотрудник = РезультатПодписания.Сотрудник;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИдентификаторПечатнойФормы = "ПФ_MXL_ТрудовойДоговор" Или ИдентификаторПечатнойФормы = "ПФ_MXL_ТрудовойДоговорПриДистанционнойРаботе" Тогда
		
		Если Не Файл.ВладелецФайла.Метаданные().Реквизиты.Найти("Сотрудник") = Неопределено Тогда
			СотрудникТрудовогоДоговора = Файл.ВладелецФайла.Сотрудник;
		Иначе
			СотрудникТрудовогоДоговора = Сотрудник;
		КонецЕсли;
		
		ДанныеТрудовогоДоговора = Неопределено;
		Если Не СотрудникТрудовогоДоговора = Неопределено Тогда
			ДанныеТрудовогоДоговора = ИнтеграцияС1САрхивом.ДанныеТрудовогоДоговора(Файл.ВладелецФайла, СотрудникТрудовогоДоговора);
			Если ДанныеТрудовогоДоговора = Неопределено Тогда
				ДанныеТрудовогоДоговора = ИнтеграцияС1САрхивом.КадровыеДанныеСотрудника(Файл.ВладелецФайла.Дата, СотрудникТрудовогоДоговора);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ДанныеТрудовогоДоговора = Неопределено Тогда
			НомерДокумента = ДанныеТрудовогоДоговора.ТрудовойДоговорНомер;
			ДатаДокумента = ДанныеТрудовогоДоговора.ТрудовойДоговорДата;
		КонецЕсли;

	КонецЕсли;
	
	ВидДокументаБИА = Справочники.ВидыДокументовБИА.НайтиВидДокумента(ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных);
	
	Сведения1САрхив = РегистрыСведений.СведенияОФайлах1САрхив.ПараметрыРегистрацииСведенийОФайле();
	Сведения1САрхив.Файл = Файл;
	Сведения1САрхив.ВидДокументаБИА = ВидДокументаБИА;
	Сведения1САрхив.ИдентификаторПечатнойФормы = ИдентификаторПечатнойФормы;
	Сведения1САрхив.Сотрудник = Сотрудник;
	Сведения1САрхив.Номер = НомерДокумента;
	Сведения1САрхив.Дата = ДатаДокумента;
	
	Если ЗначениеЗаполнено(ВидДокументаБИА) Тогда
		Сведения1САрхив.Вставить("НеВыгружать", ВидДокументаБИА.НеВыгружать);
	КонецЕсли;
	
	ИнтеграцияС1САрхивом.ЗаписатьСведения1САрхив(Сведения1САрхив);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияОФайлах

Функция ВидДокументаБИАУстановлен(ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных) Экспорт
	ВидДокументаБИА = Справочники.ВидыДокументовБИА.НайтиВидДокумента(ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных);
	Возврат ЗначениеЗаполнено(ВидДокументаБИА);
КонецФункции

Функция ИдентификаторРегламентированногоОтчета(Знач ИсточникОтчета) Экспорт

	Если ТипЗнч(ИсточникОтчета) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		ИсточникОтчета = ИсточникОтчета.ИсточникОтчета;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет."+ИсточникОтчета);
КонецФункции

#КонецОбласти

#Область Формы

Функция ДокументыБИАРегламентированногоОтчета(ТекущиеДанные) Экспорт
	
	ТаблицаДокументовБИА = Неопределено;
	
	Если Не ТекущиеДанные = Неопределено 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Ссылка") Тогда
		ТаблицаДокументовБИА = ОбменСАрхивом.ТаблицаДокументовБИА(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Если Не ТаблицаДокументовБИА = Неопределено Тогда
		ТаблицаДокументовБИА = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДокументовБИА);
	КонецЕсли;
	
	Возврат ТаблицаДокументовБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
